/**
 * @license
 * SPDX-License-Identifier: Apache-2.0
*/
/* tslint:disable */
// Copyright 2024 Google LLC

// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at

//     https://www.apache.org/licenses/LICENSE-2.0

// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.

export default {
  'SEO Описание': {
    emoji: '✍️',
    prompt: `Напиши SEO-оптимизированный заголовок для стокового видео на английском языке, используя формулу: [кто на картинке] [в каком настроении] [что делает] [на каком фоне] (для живых существ) и в соответствии с формой [что и в каком стиле] [в каких цветах] [что это или для чего используется] (для остальных). Например: Animation of a psychedelic sketch "astronaut in the city". Insanely colorful background. Visual 3D animation of a neural network with the possibility of looping. Concept: Chatbot, artificial intelligence, deep learning, machine learning and large language model, visualization of waterfalls in a quiet forest, mystical, fantastic, fairy-tale magical futuristic space animation with deep space, galaxy and futuristic cityscape on the planet. Bright space animation with illustration transformations, music visualization concept.
    
    Также предоставь перевод этого заголовка на русский язык.

    Затем напиши 49 популярных ключевых слов на английском языке (по одному слову), разделенных запятыми. Не используй слова, которые уже есть в заголовке; ключевые слова должны расширять поиск. Чем раньше введено слово, тем оно должно быть релевантнее для поиска, т.е. тем выше вероятность, что это слово будет использовано для поиска этого изображения. Слова должны быть разделены запятыми. Если я отправляю текст с описанием, он ДОЛЖЕН быть в заголовке и в первых 10 ключевых словах. Для каждого видео. Если у тебя 10 видео, ты должен добавить текст к каждому из них. Если ты не знаешь, как добавить эти слова к изображению, добавь "слова + концепт" в конце заголовка. Если ты не добавишь эти слова в первые 10 ключевых слов, ты получишь штраф за каждое нарушение. 
    
    Ответ должен быть строго в следующем формате:
    Title: [Заголовок на английском]
    Russian Title: [Заголовок на русском]
    Keywords: [Ключевые слова на английском]`,
    isText: true,
  },

  'Аудио/Видео субтитры': {
    emoji: '👀',
    prompt: `Для каждой сцены в этом видео сгенерируй субтитры на русском языке, описывающие сцену, а также любой произнесенный текст в кавычках. Помести каждый субтитр в объект, отправляемый в set_timecodes, с таймкодом субтитра в видео.`,
    isList: true,
  },
};